package com.ecochain.user.entity;

public interface CommonConstant {
    /**
     * 邮箱验证规则
     */
    String EMAIL_PATTERN                        = "^(\\w)+(\\.\\w+)*@(\\w)+((\\.\\w+)+)$";

    /**
     * 手机号验证规则
     */
    String MOBILE_PATTERN                       = "^(1[3|4|5|7|8])[0-9]{9}$";
    
    /**
     * 18位身份证|15位身份证
     */
    //String IDCRAD_PATTERN                     = "(^(\\d{17})(\\d|[xX])$)?";
    //String IDCRAD_PATTERN                     = "^(^[1-9]\\d{7}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}$)|(^[1-9]\\d{5}[1-9]\\d{3}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])((\\d{4})|\\d{3}[X])$)$";
    String IDCRAD_PATTERN                       = "^(\\d{15}|\\d{17}[\\dX])$";
    
    /**
     * 密码（包含数字和字母）
     */
    String PASSWORD_PATTERN                     = "^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,20}$";

    /**
     * 密码（包含数字、字母和任意特殊字符两种及以上）
     */
    String PASSWORD_PATTERN2                    = "^(?![A-z]+$)(?!\\d+$)(?![\\W]+$)\\S{8,20}$";

    /**
     * 密码（包含数字、字母和（~!@#$%^&*()_~！@#￥%……&*（）——）中的特殊字符中的两种及以上）
     */
    String PASSWORD_PATTERN3                    = "^(?![A-Z]+$)(?![a-z]+$)(?!\\d+$)(?![~!@#$%^&*()_~！@#￥%……&*（）——]+$)[A-z\\d~!@#$%^&*()_~！@#￥%……&*（）——]{8,20}$";

    /**
     * 密码（包含数字、字母和（~!@#$%^&*()_~！@#￥%……&*（）——）中的特殊字符三种以上)
     */
    String PASSWORD_PATTERN4                    = "(?=.*[A-z])(?=.*\\d)(?=.*[~!@#$%^&*()_~！@#￥%……&*（）——])[A-z\\d~!@#$%^&*()_~！@#￥%……&*（）——]{8,20}$";


    //String PASSWORD_PATTERN5                  = "^(?![0-9]+$)(?![A-z]+$)(?![^A-z0-9]+$)^.{8,20}$";

    /**
     * 不能含有特殊字符
     */
    String NAME_PATTERN                         = "^([a-zA-Z0-9\u4e00-\u9fa5()\\-（）——]*)$";
}
